<!doctype html>
<html lang="en">
<head>
    <?php
    $page_title = 'vIT News (PHP edition)';
    include 'blocks/head.php'
    ?>
</head>
<?php include 'blocks/header.php' ?>
<body>
    <main class="container">
        <div class="row">
            <div class="col-md-8 mb-5">
                <?php
                    require_once 'main.php';
                ?>
            </div>
            <?php include 'blocks/side.php' ?>
        </div>
    </main>
</body>
<?php include 'blocks/footer.php' ?>
</html>


<!--ОСНОВЫ WEB ПРОГРАМУВАННЯ
-  -  -  -  -  -  -  -  -  -  -
Викладач: Крилов Євген Володимирович

1. Іспит здаємо на зимовій сесії.
Форма проведення іспиту - у формі захисту індивідуального завдання. Усі запитання конкретно по коду, до тегів, змінних, операторів, циклів і т.д.
Базові елементи HTML, CSS, PHP, про які буде сказано нижче треба знати на пам'ять і впевнено відповідати.

2. Індивідуальне завдання виконується на комп'ютері, роздруковувати нічого не потрібно. Приходимо із власним ноутбуком і викладач задає питання по коду.
Завдання - розробити сайт, ТЕМА САЙТУ НА ВЛАСНИЙ РОЗСУД. Сайт може бути кращим або гіршим, але його треба представити.

При розробці сайту необхідно обов'язково реалізувати і впевнено знати наступні технології (МІНІМАЛЬНІ ВИМОГИ):

1) HTML+CSS - мінімум 3...4 сторінки та переходи між ними.
HTML:
- теги: вирівнювання, таблиці, списки
- форми
Необхідно реалізувати в своему проекті і відповідати на іспиті.

CSS:
- в зовнішньому файлі створити класи CSS, і лінком в HTML прикріпити цей файл. Далі в самому html вказати значення відповідних класів.
- реалізувати пріорітетність стилів (у тому числі із використанням important). Показати конфліктну ситуацію в CSS із цим пов'язану.
- реалізувати наслідування в CSS (контекстні селектори).
Необхідно реалізувати в своему проекті і відповідати на іспиті.

2) Адаптивність сайту - за його відсутності не критично, але оцінка буде меншою.
Питання по адаптивності сайтів задаватися не будуть.

3) PHP - реалізувати щось за допомогою даної технології: форму зворотнього зв'язку, форму реєстрації або щось інше.
PHP:
- змінні
- умови і цикли if, elseif, else, while, for, switch
- оператори break, continue
- операції роботи з файлами
- масиви, процедура for each для масивів
Необхідно реалізувати в своему проекті і відповідати на іспиті.

4) mySQL -не вимагається, але хто бажає може реалізувати у своєму проекті, це вплине на оцінку

Загалом, чим кращий проект тим краща оцінка.
-->